Ran Plan for 11 projects:

1. dir: `cloudflare` workspace: `default`
1. dir: `gcp/organization` workspace: `default`
1. dir: `gcp/projects/firebees` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `gcp/projects/jonpulsifer` workspace: `default`
1. dir: `gcp/projects/kubesec` workspace: `default`
1. dir: `gcp/projects/lolcorp` workspace: `default`
1. dir: `gcp/projects/trusted-builds` workspace: `default`
1. dir: `gcp/projects/wishin-app` workspace: `default`
1. dir: `unifi` workspace: `default`
1. dir: `workspace` workspace: `default`
---

### 1. dir: `cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.pulsifer_ca_dnssec will be updated in-place
! resource "cloudflare_zone_dnssec" "pulsifer_ca_dnssec" {
+       algorithm        = (known after apply)
+       digest           = (known after apply)
+       digest_algorithm = (known after apply)
+       digest_type      = (known after apply)
+       ds               = (known after apply)
+       flags            = (known after apply)
        id               = "7b0fdf753795ec69a1318f64be8d2479"
+       key_tag          = (known after apply)
+       key_type         = (known after apply)
+       modified_on      = (known after apply)
+       public_key       = (known after apply)
-       status           = "disabled" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `gcp/organization` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.14.1 init -input=false' in '/atlantis-data/repos/jonpulsifer/infra/363/default/gcp/organization': exit status 1
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- cloud-glue in modules/project
- firebees in modules/project
- homelab-ng in modules/project
- jonpulsifer in modules/project
- kubesec in modules/project
- lolcorp in modules/project
- secure-the-cloud in modules/project
- trusted-builds in modules/project
- wishin_app in modules/project
Initializing provider plugins...
- Reusing previous version of hashicorp/google-beta from the dependency lock file
- Reusing previous version of hashicorp/google from the dependency lock file
╷
│ Error: Failed to query available provider packages
│ 
│ Could not retrieve the list of available versions for provider
│ hashicorp/google-beta: locked provider
│ registry.terraform.io/hashicorp/google-beta 7.11.0 does not match
│ configured version constraint ~> 7.10, ~> 7.13.0; must use terraform init
│ -upgrade to allow selection of new versions
│ 
│ To see which modules are currently depending on hashicorp/google-beta and
│ what versions are specified, run the following command:
│     terraform providers
╵
╷
│ Error: Failed to query available provider packages
│ 
│ Could not retrieve the list of available versions for provider
│ hashicorp/google: locked provider registry.terraform.io/hashicorp/google
│ 7.11.0 does not match configured version constraint ~> 7.10, ~> 7.13.0;
│ must use terraform init -upgrade to allow selection of new versions
│ 
│ To see which modules are currently depending on hashicorp/google and what
│ versions are specified, run the following command:
│     terraform providers
╵

```
</details>

---
### 4. dir: `gcp/projects/homelab-ng` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.14.1 plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/363/default/gcp/projects/homelab-ng/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/363/default/gcp/projects/homelab-ng': exit status 1
google_service_account_iam_policy.slingshot: Refreshing state... [id=projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com]
google_storage_bucket_iam_policy.slingshot_free: Refreshing state... [id=b/slingshot-free]
google_org_policy_policy.allowed_cloud_run_binauthz: Refreshing state... [id=projects/homelab-ng/policies/run.allowedBinaryAuthorizationPolicies]
google_org_policy_policy.allowed_cloud_run_vpc_egress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedVPCEgress]
google_service_account.slingshot: Refreshing state... [id=projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_functions_vpc_connector_egress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedVpcConnectorEgressSettings]
google_org_policy_policy.allowed_locations: Refreshing state... [id=projects/homelab-ng/policies/gcp.resourceLocations]
google_storage_bucket.homelab_ng: Refreshing state... [id=homelab-ng]
google_kms_key_ring.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault]
google_service_account.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_functions_ingress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedIngressSettings]
google_org_policy_policy.allow_all_services: Refreshing state... [id=projects/homelab-ng/policies/serviceuser.services]
data.google_storage_bucket_objects.files: Reading...
google_org_policy_policy.allow_all_domains: Refreshing state... [id=projects/homelab-ng/policies/iam.allowedPolicyMemberDomains]
google_org_policy_policy.allow_functions_without_vpc_connector: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.requireVPCConnector]
data.google_iam_policy.gcs_homelab_ng: Reading...
google_service_account.ddnsd: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.gcs_homelab_ng: Read complete after 0s [id=3702782091]
google_service_account.view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com]
google_service_account.vm: Refreshing state... [id=projects/homelab-ng/serviceAccounts/oldboy@homelab-ng.iam.gserviceaccount.com]
google_service_account.terraform: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
google_service_account.ddns: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddns-function@homelab-ng.iam.gserviceaccount.com]
data.google_storage_bucket_objects.files: Read complete after 0s [id=homelab-ng-free]
google_org_policy_policy.allow_service_account_keys: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountKeyCreation]
google_org_policy_policy.allowed_storage_retention_policy_seconds: Refreshing state... [id=projects/homelab-ng/policies/storage.retentionPolicySeconds]
google_iam_workload_identity_pool.homelab: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab]
google_project_service.service["appengine.googleapis.com"]: Refreshing state... [id=homelab-ng/appengine.googleapis.com]
google_project_service.service["cloudidentity.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudidentity.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=homelab-ng/run.googleapis.com]
google_service_account.vault: Refreshing state... [id=projects/homelab-ng/serviceAccounts/vault-id@homelab-ng.iam.gserviceaccount.com]
google_project_service.service["bigquery.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquery.googleapis.com]
google_project_service.service["cloudfunctions.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudfunctions.googleapis.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudresourcemanager.googleapis.com]
google_project_service.service["vision.googleapis.com"]: Refreshing state... [id=homelab-ng/vision.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=homelab-ng/monitoring.googleapis.com]
google_project_service.service["pubsub.googleapis.com"]: Refreshing state... [id=homelab-ng/pubsub.googleapis.com]
google_project_service.service["container.googleapis.com"]: Refreshing state... [id=homelab-ng/container.googleapis.com]
google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-component.googleapis.com]
google_project_service.service["orgpolicy.googleapis.com"]: Refreshing state... [id=homelab-ng/orgpolicy.googleapis.com]
google_project_service.service["dns.googleapis.com"]: Refreshing state... [id=homelab-ng/dns.googleapis.com]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbilling.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=homelab-ng/containerregistry.googleapis.com]
google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=homelab-ng/iap.googleapis.com]
google_project_service.service["admin.googleapis.com"]: Refreshing state... [id=homelab-ng/admin.googleapis.com]
google_project_service.service["cloudkms.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudkms.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=homelab-ng/compute.googleapis.com]
google_project_service.service["containeranalysis.googleapis.com"]: Refreshing state... [id=homelab-ng/containeranalysis.googleapis.com]
google_project_service.service["oslogin.googleapis.com"]: Refreshing state... [id=homelab-ng/oslogin.googleapis.com]
google_project_service.service["binaryauthorization.googleapis.com"]: Refreshing state... [id=homelab-ng/binaryauthorization.googleapis.com]
google_project_service.service["maps-backend.googleapis.com"]: Refreshing state... [id=homelab-ng/maps-backend.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=homelab-ng/iamcredentials.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=homelab-ng/iam.googleapis.com]
google_project_service.service["cloudasset.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudasset.googleapis.com]
google_project_service.service["domains.googleapis.com"]: Refreshing state... [id=homelab-ng/domains.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=homelab-ng/logging.googleapis.com]
google_project_service.service["groupssettings.googleapis.com"]: Refreshing state... [id=homelab-ng/groupssettings.googleapis.com]
google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-api.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbuild.googleapis.com]
google_project_service.service["bigquerystorage.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquerystorage.googleapis.com]
google_project_service.service["websecurityscanner.googleapis.com"]: Refreshing state... [id=homelab-ng/websecurityscanner.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=homelab-ng/serviceusage.googleapis.com]
google_org_policy_policy.allowed_workload_identity_providers: Refreshing state... [id=projects/homelab-ng/policies/iam.workloadIdentityPoolProviders]
google_org_policy_policy.allowed_cloud_build_worker_pools: Refreshing state... [id=projects/homelab-ng/policies/cloudbuild.allowedWorkerPools]
google_org_policy_policy.allowed_cloud_run_ingress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedIngress]
google_org_policy_policy.allow_service_accounts: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountCreation]
google_storage_bucket.vault: Refreshing state... [id=homelab-ng-vault]
google_storage_bucket.slingshot: Refreshing state... [id=slingshot-free]
google_compute_address.oldboy: Refreshing state... [id=projects/homelab-ng/regions/us-east1/addresses/oldboy]
module.network.google_compute_network.network: Refreshing state... [id=projects/homelab-ng/global/networks/vpc]
google_kms_crypto_key.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault]
google_storage_bucket.free: Refreshing state... [id=homelab-ng-free]
google_project_iam_member.github_actions_function_admin: Refreshing state... [id=homelab-ng/roles/cloudfunctions.admin/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
google_storage_bucket_iam_policy.homelab_ng: Refreshing state... [id=homelab-ng]
google_compute_image.nixos: Refreshing state... [id=projects/homelab-ng/global/images/nixos]
google_project_iam_member.ddnsd: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceAccount:ddnsd-id@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.ddnsd_token_creator: Reading...
data.google_iam_policy.ddnsd_token_creator: Read complete after 0s [id=712373999]
google_project_iam_member.ddnsbot: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceaccount:ddns-function@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.terraform_token_creator: Reading...
google_service_account_iam_member.github_actions_view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.terraform_token_creator: Read complete after 0s [id=4001634528]
google_project_iam_member.view_counter_firestore: Refreshing state... [id=homelab-ng/roles/datastore.user/serviceAccount:view-counter@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.github_actions: Reading...
data.google_iam_policy.github_actions: Read complete after 0s [id=1832452650]
data.google_iam_policy.free: Reading...
data.google_iam_policy.free: Read complete after 0s [id=3790195915]
data.google_iam_policy.gcs_vault: Reading...
data.google_iam_policy.gcs_vault: Read complete after 0s [id=1208234218]
google_project_iam_member.vault: Refreshing state... [id=homelab-ng/organizations/5046617773/roles/readOnlyVault/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
data.onepassword_item.cloudflare_api_token: Reading...
google_iam_workload_identity_pool_provider.vercel: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/vercel]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/github]
google_kms_crypto_key_iam_member.vault_encrypt_decrypt: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key_iam_member.vault_viewer: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.viewer/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_policy.ddnsd_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_policy.terraform_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
data.onepassword_item.cloudflare_api_token: Read complete after 1s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/3x5gu5niywi6iza3jxxny7ifsy]
module.network.google_compute_firewall.ssh: Refreshing state... [id=projects/homelab-ng/global/firewalls/terraform-auto-ssh-firewall]
module.network.google_compute_subnetwork.subnet: Refreshing state... [id=projects/homelab-ng/regions/us-east1/subnetworks/computers]
google_service_account_iam_policy.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_storage_bucket_iam_policy.free: Refreshing state... [id=b/homelab-ng-free]
google_storage_bucket_iam_policy.vault: Refreshing state... [id=b/homelab-ng-vault]
google_compute_disk.oldboy: Refreshing state... [id=projects/homelab-ng/zones/us-east1-b/disks/oldboy]
cloudflare_dns_record.oldboy: Refreshing state... [id=bdbd2fdeee6264229fae1ac8138dff8f]
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s
google_compute_instance.oldboy: Refreshing state... [id=projects/homelab-ng/zones/us-east1-b/instances/oldboy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # google_iam_workload_identity_pool_provider.vercel will be updated in-place
  ~ resource "google_iam_workload_identity_pool_provider" "vercel" {
      ~ attribute_condition                = "assertion.sub.startsWith('owner:jonpulsifers-projects:project:')" -> "assertion.sub.startsWith('owner:jonpulsifers-projects:project:') && assertion.environment == 'production'"
        id                                 = "projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/vercel"
        name                               = "projects/629296473058/locations/global/workloadIdentityPools/homelab/providers/vercel"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_service_account.slingshot will be destroyed
  # (because google_service_account.slingshot is not in configuration)
  - resource "google_service_account" "slingshot" {
      - account_id   = "slingshot" -> null
      - disabled     = false -> null
      - display_name = "Slingshot Service Account" -> null
      - email        = "slingshot@homelab-ng.iam.gserviceaccount.com" -> null
      - id           = "projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:slingshot@homelab-ng.iam.gserviceaccount.com" -> null
      - name         = "projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com" -> null
      - project      = "homelab-ng" -> null
      - unique_id    = "111466442837837090166" -> null
        # (1 unchanged attribute hidden)
    }

  # google_service_account_iam_policy.slingshot will be destroyed
  # (because google_service_account_iam_policy.slingshot is not in configuration)
  - resource "google_service_account_iam_policy" "slingshot" {
      - etag               = "BwZFYa0SQwA=" -> null
      - id                 = "projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com" -> null
      - policy_data        = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:development",
                          - "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:production",
                          - "serviceAccount:slingshot@homelab-ng.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        ) -> null
      - service_account_id = "projects/homelab-ng/serviceAccounts/slingshot@homelab-ng.iam.gserviceaccount.com" -> null
    }

  # google_storage_bucket.free will be updated in-place
  ~ resource "google_storage_bucket" "free" {
        id                          = "homelab-ng-free"
        name                        = "homelab-ng-free"
        # (17 unchanged attributes hidden)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 1
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
╷
                # (3 unchanged attributes hidden)
│ Error: Error when reading or editing Storage Bucket "slingshot-free": googleapi: Error 403: terraform@homelab-ng.iam.gserviceaccount.com does not have storage.buckets.get access to the Google Cloud Storage bucket. Permission 'storage.buckets.get' denied on resource (or it may not exist)., forbidden
            }
│ 
│ 
╵
        }

        # (2 unchanged blocks hidden)
    }

╷
│ Error: Error when reading or editing Resource "storage bucket \"b/slingshot-free\"" with IAM Policy: Error retrieving IAM policy for storage bucket "b/slingshot-free": googleapi: Error 403: terraform@homelab-ng.iam.gserviceaccount.com does not have storage.buckets.getIamPolicy access to the Google Cloud Storage bucket. Permission 'storage.buckets.getIamPolicy' denied on resource (or it may not exist)., forbidden
│ 
Plan: 0 to add, 2 to change, 2 to destroy.
│ 
╵

```
</details>

---
### 10. dir: `unifi` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false' in '/atlantis-data/repos/jonpulsifer/infra/363/default/unifi': exit status 1
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Terraform encountered problems during initialisation, including problems
│ with the configuration, described below.
│ 
│ The Terraform configuration must be valid before initialization so that
│ Terraform can determine which modules and providers need to be installed.
│ 
│ 
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 2, in locals:
│    2:   fml_cidr   = "10.1.0.0/24"
│ 
│ A local value named "fml_cidr" was already defined at home.tf:2,3-29. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 3, in locals:
│    3:   fml_domain = "fml.pulsifer.ca"
│ 
│ A local value named "fml_domain" was already defined at home.tf:3,3-33.
│ Local value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 4, in locals:
│    4:   fml_wlan   = "fml"
│ 
│ A local value named "fml_wlan" was already defined at home.tf:4,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 5, in locals:
│    5:   clients    = yamldecode(file("./clients.yaml"))
│ 
│ A local value named "clients" was already defined at home.tf:5,3-50. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 6, in locals:
│    6:   one_day    = 86400
│ 
│ A local value named "one_day" was already defined at home.tf:6,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 7, in locals:
│    7:   one_week   = local.one_day * 7
│ 
│ A local value named "one_week" was already defined at home.tf:7,3-33. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate resource "unifi_network" configuration
│ 
│   on management.tf line 10:
│   10: resource "unifi_network" "fml" {
│ 
│ A unifi_network resource named "fml" was already declared at
│ home.tf:10,1-31. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "unifi_ap_group" configuration
│ 
│   on management.tf line 32:
│   32: data "unifi_ap_group" "all_aps" {
│ 
│ A unifi_ap_group data resource named "all_aps" was already declared at
│ home.tf:32,1-32. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "vault_generic_secret" configuration
│ 
│   on management.tf line 36:
│   36: data "vault_generic_secret" "wifi" {
│ 
│ A vault_generic_secret data resource named "wifi" was already declared at
│ home.tf:36,1-35. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_wlan" configuration
│ 
│   on management.tf line 40:
│   40: resource "unifi_wlan" "fml" {
│ 
│ A unifi_wlan resource named "fml" was already declared at home.tf:40,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 58:
│   58: resource "unifi_user" "personal_devices" {
│ 
│ A unifi_user resource named "personal_devices" was already declared at
│ home.tf:58,1-41. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 73:
│   73: resource "unifi_user" "computers" {
│ 
│ A unifi_user resource named "computers" was already declared at
│ home.tf:73,1-34. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 88:
│   88: resource "unifi_user" "iot" {
│ 
│ A unifi_user resource named "iot" was already declared at home.tf:88,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 103:
│  103: resource "unifi_user" "cameras" {
│ 
│ A unifi_user resource named "cameras" was already declared at
│ home.tf:103,1-32. Resource names must be unique per type in each module.
╵

```
</details>

---
### Plan Summary

11 projects, 1 with changes, 7 with no changes, 3 failed